package inheritanceAndPolymorphism_06_02;
/*
Цель задания
Освоить на практике наследование классов.
Что нужно сделать
1. Создайте класс BankAccount, который представляет собой расчётный счёт в банке. У класса необходимо написать методы:
     a. Снять со счёта сумму денег (без комиссии).
     b. Вносить на счёт сумму денег (без комиссии).
     c. Получить остаток на счёте.
2. Создайте два класса наследника, расширяющие работу с остатком на счёте:
•	Депозитный расчётный счёт, с которого нельзя снимать деньги в течение месяца после последнего внесения.
•	Карточный счёт, при снятии денег с которого будет взиматься комиссия 1%.
 */

public class BankAccount {
    /* Снять со счёта сумму денег (без комиссии). */
    public Boolean withdrawMoney(double ivSum) {
        return false;
    }

    /* Вносить на счёт сумму денег (без комиссии). */
    public void makeMoney(double ivSum) {
    }

    /* Получить остаток на счёте. */
    public double getRestMoney() {
        return 0.0d;
    }

    /* Для отправки денег с одного счёта на другой.
       Метод должен вернуть true, если деньги успешно переведены. */
    public boolean send(BankAccount ioReceiver, double ivAmount) {
        return false;
    }
}